blog-posts/2008-08-12-why-browse-the-web-in-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Why browse the Web in Emacs?</title>
<!-- 2015-10-19 Mon 14:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Why browse the Web in Emacs?</h1>
<p>
August 12th, 2008 -
<a href="http://sachachua.com/blog/p/5064"><a href="http://sachachua.com/blog/p/5064">http://sachachua.com/blog/p/5064</a></a>
</p>

<p>
“Are you browsing Slashdot in Emacs?”, W- asked me after he glanced at
my screen.
</p>

<p>
With Emacs' reputation for including everything \<sub>and\</sub>_ the kitchen
sink, you probably won't be surprised to hear that there's more than one
way to surf the Internet using your text editor. With today's
Javascript- and image-heavy websites, it can be hard to believe that
anyone would use a text-based browser with limited support for many of
the things we take for granted. Still, a Web browser in your text editor
can be surprisingly useful. Here are some of the reasons why you might
like it:
</p>

<ul class="org-ul">
<li><b>Browsing is faster and less distracting.</b> Forget flashing ads,
garish colors, and large images. When you surf the Web in Emacs, you
can focus on reading, and you can use all the typical Emacs shortcuts
for navigating around. You can view images when you want to.
 If you need to see something that Emacs doesn't support, you can
easily open the current page in an external Web browser.
</li>
<li><b>You can integrate it into your work.</b> With a little bit of Emacs
Lisp, you can qucikly look up information on the Web based on what
you're currently working on. For example, PHP mode comes with a
shortcut that lets you look up the current function's documentation
in the PHP manual. You can look up bug report details, dictionary
definitions, and Wikipedia pages with minimal typing, too. If you use
Emacspeak, you can set up the web browser to speech-synthesize more
than what's displayed on screen. The more you use Emacs, the more
benefits you get from the integration.
</li>
<li><b>You can customize everything.</b> You can customize your Emacs
experience quickly and easily, and if you spend a lot of time on the
Net, you'll appreciate having your own shortcuts and functions. For
example, I've completely remapped my keyboard shortcuts to support
tabbed browsing on a Dvorak keyboard, and I've defined a few
functions to make frequently-used commands much easier. You can even
use functions to process Web pages and either summarize the
information you're interested in or make pages more navigable. It's
all just Emacs Lisp.
</li>
<li><b>You're safe from browser exploits.</b> No Javascript pop-ups, no image
bugs, no browser-based malware that can take over your comuter or
steal data. Just content.
</li>
<li><b>You need less memory.</b> Why open up a memory-intensive graphical
Web-based browser when you've got Emacs open anyway?
</li>
</ul>

<p>
There's more than one way to browse the Web in Emacs, of course.
Browse-url is a package that makes it easy to open URLs in your
preferred browser or browsers. For example, you can use it to browse the
Web in Mozilla Firefox, and (of course) you can use it to browse the Web
within Emacs itself. For browsing within Emacs, you can use w3m.el, an
interface to the external W3M browser, or w3, a Web browser written
entirely in Emacs Lisp. Of the two, I prefer w3m.el, which is much
faster and more featureful than w3. Both can display graphics, tables,
and frames, and w3 supports stylesheets.
</p>

<p>
More about Emacs and browsing the Web soon! Planned projects for this
chapter of <a href="http://sachachua.com/category/wp/wickedcoolemacs">Wicked
Cool Emacs</a>:
</p>

<pre class="example">
*** Project XXX: Browse the Web
*** Project XXX: Open the current webpage in an external browser
*** Project XXX: Different browsers for different pages
*** Project XXX: Toggle between Web and work
*** Project XXX: Quick search
*** Project XXX: Customize your keymap
*** Project XXX: Download files
*** Project XXX: Add access keys
*** Project XXX: Use social bookmarking
*** Project XXX: Typeahead
*** Project XXX: Preview HTML
*** Project XXX: Read Web pages as news
</pre>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
